v2506/run/verification1/0.orig/CO2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    farfield
    {
        type            codedFixedValue;
        value           $internalField;
        name            massTransferCO2;
        
        code
        #{
            const scalar K_ext = 1.3e-3; // External mass transfer coefficient [m/s]
            const scalar D_CO2_l = 2e-10; // Diffusion coefficient of CO2 in liquid phase [m²/s]
            const scalar C_CO2_g = 1.63578e-05; // Saturation concentration of CO2 in liquid phase
            const scalar H_cc = 3.25; // Henry's law constant for CO2 [mol/(m³·Pa)]

            const volScalarField& CO2 = this->db().lookupObject<volScalarField>("CO2");

            Info << "Applying mass transfer boundary condition for CO2 on patch: " << patch().name() << endl;

            scalarField& patchField = *this;
            forAll(patchField, faceI)
            {
                label cellI = patch().faceCells()[faceI];

                scalar cellValue = CO2[cellI];
                scalar C_CO2_grad = K_ext/D_CO2_l * (C_CO2_g - patchField[faceI]/H_cc);

                patchField[faceI] = cellValue + C_CO2_grad / (patch().deltaCoeffs()[faceI]);
            }
        #};
    }
    lower_inner
    {
        type            fixedValue;
        value           uniform 0;
    }
    upper_inner
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "wedge.*"
    {
        type            wedge;
    }
}


// ************************************************************************* //
