v2506/run/verification1/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    lower_inner
    {
        type    codedFixedValue;
        value   $internalField;  // dummy, gets overwritten by code

        name    parabolicInlet;

        code
        #{
            const scalar Uavg = 3.84e-05;  // Max velocity
            const vectorField& faceCentres = patch().Cf(); 
            static bool firstTime = true;
            static scalar R = -GREAT;

            vectorField& field = *this;

            if (firstTime)
            {  
                const pointField& points = patch().patch().points();

                forAll(points, i)
                {
                    R = max(R, points[i].x());
                }
                firstTime = false;
            }

            forAll(field, i)
            {
                scalar x = faceCentres[i].x();
                scalar z = faceCentres[i].z();
                scalar r = sqrt(x*x + z*z);
                scalar Uy = 2*Uavg * (1.0 - r*r/R/R);
                field[i] = vector(0, Uy, 0);
            }
        #};
    }
    upper_inner
    {
        type            zeroGradient;
        value           $internalField;
    }
    farfield
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "wedge.*"
    {
        type            wedge;
    }
}


// ************************************************************************* //
