v2506/run/verification1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          1e-4;
        maxIter         1000;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          1e-4;
        maxIter         1000;
    }

    S
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        maxIter         1000;
    }

    CO2
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        maxIter         1000;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    nCorrectors         2;
    consistent          yes;
    momentumPredictor   yes;

    residualControl
    {
        p               1e-5;   // Less strict initially
        S               1e-6;   // Less strict initially
        CO2             1e-6;   // Less strict initially
    }
}

// ************************************************************************* //
